; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-3nodes-1000size-3degree-100mindistance-2trucks-7packages-1308seed

(define (problem transport-three-cities-sequential-3nodes-1000size-3degree-100mindistance-2trucks-7packages-1308seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-3-loc-3 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  package-7 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 184,723 -> 509,597
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 35)
  ; 509,597 -> 184,723
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 35)
  ; 816,855 -> 509,597
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 41)
  ; 509,597 -> 816,855
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 41)
  ; 816,855 -> 184,723
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 65)
  ; 184,723 -> 816,855
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 65)
  ; 2584,503 -> 2175,332
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 45)
  ; 2175,332 -> 2584,503
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 45)
  ; 2878,964 -> 2584,503
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 55)
  ; 2584,503 -> 2878,964
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 55)
  ; 1506,2879 -> 1246,2888
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 26)
  ; 1246,2888 -> 1506,2879
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 26)
  ; 1493,2468 -> 1246,2888
  (road city-3-loc-3 city-3-loc-1)
  (= (road-length city-3-loc-3 city-3-loc-1) 49)
  ; 1246,2888 -> 1493,2468
  (road city-3-loc-1 city-3-loc-3)
  (= (road-length city-3-loc-1 city-3-loc-3) 49)
  ; 1493,2468 -> 1506,2879
  (road city-3-loc-3 city-3-loc-2)
  (= (road-length city-3-loc-3 city-3-loc-2) 42)
  ; 1506,2879 -> 1493,2468
  (road city-3-loc-2 city-3-loc-3)
  (= (road-length city-3-loc-2 city-3-loc-3) 42)
  ; 816,855 <-> 2175,332
  (road city-1-loc-3 city-2-loc-1)
  (= (road-length city-1-loc-3 city-2-loc-1) 146)
  (road city-2-loc-1 city-1-loc-3)
  (= (road-length city-2-loc-1 city-1-loc-3) 146)
  (road city-1-loc-3 city-3-loc-1)
  (= (road-length city-1-loc-3 city-3-loc-1) 146)
  (road city-3-loc-1 city-1-loc-3)
  (= (road-length city-3-loc-1 city-1-loc-3) 146)
  (road city-2-loc-1 city-3-loc-1)
  (= (road-length city-2-loc-1 city-3-loc-1) 169)
  (road city-3-loc-1 city-2-loc-1)
  (= (road-length city-3-loc-1 city-2-loc-1) 169)
  (at package-1 city-2-loc-1)
  (at package-2 city-3-loc-1)
  (at package-3 city-1-loc-1)
  (at package-4 city-1-loc-1)
  (at package-5 city-3-loc-1)
  (at package-6 city-2-loc-1)
  (at package-7 city-1-loc-1)
  (at truck-1 city-3-loc-1)
  (capacity truck-1 capacity-2)
  (at truck-2 city-3-loc-2)
  (capacity truck-2 capacity-3)
 )
 (:goal (and
  (at package-1 city-3-loc-2)
  (at package-2 city-2-loc-1)
  (at package-3 city-2-loc-2)
  (at package-4 city-2-loc-1)
  (at package-5 city-2-loc-2)
  (at package-6 city-2-loc-3)
  (at package-7 city-3-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-3-loc-2 city-3-loc-1)
   deleted: (at truck-2 city-3-loc-2)
   added: (at truck-2 city-3-loc-1)
   goals met: 0 of 7
2. (drive truck-2 city-3-loc-1 city-1-loc-3)
   deleted: (at truck-2 city-3-loc-1)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 7
3. (drive truck-2 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 7
4. (pick-up truck-2 city-1-loc-1 package-7 capacity-2 capacity-3)
   deleted: (at package-7 city-1-loc-1) (capacity truck-2 capacity-3)
   added: (in package-7 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 7
5. (pick-up truck-2 city-1-loc-1 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-1) (capacity truck-2 capacity-2)
   added: (in package-4 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 7
6. (pick-up truck-2 city-1-loc-1 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-1) (capacity truck-2 capacity-1)
   added: (in package-3 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 7
7. (drive truck-2 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 7
8. (drive truck-2 city-1-loc-3 city-2-loc-1)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-2-loc-1)
   goals met: 0 of 7
9. (drop truck-2 city-2-loc-1 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-2) (capacity truck-2 capacity-0)
   added: (at package-4 city-2-loc-1) (capacity truck-2 capacity-1)
   goals met: 1 of 7
10. (pick-up truck-2 city-2-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-2-loc-1) (capacity truck-2 capacity-1)
   added: (in package-1 truck-2) (capacity truck-2 capacity-0)
   goals met: 1 of 7
11. (drive truck-2 city-2-loc-1 city-3-loc-1)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-3-loc-1)
   goals met: 1 of 7
12. (drive truck-2 city-3-loc-1 city-3-loc-3)
   deleted: (at truck-2 city-3-loc-1)
   added: (at truck-2 city-3-loc-3)
   goals met: 1 of 7
13. (drop truck-2 city-3-loc-3 package-7 capacity-0 capacity-1)
   deleted: (in package-7 truck-2) (capacity truck-2 capacity-0)
   added: (at package-7 city-3-loc-3) (capacity truck-2 capacity-1)
   goals met: 2 of 7
14. (drive truck-2 city-3-loc-3 city-3-loc-2)
   deleted: (at truck-2 city-3-loc-3)
   added: (at truck-2 city-3-loc-2)
   goals met: 2 of 7
15. (drop truck-2 city-3-loc-2 package-1 capacity-1 capacity-2)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-1)
   added: (at package-1 city-3-loc-2) (capacity truck-2 capacity-2)
   goals met: 3 of 7
16. (drive truck-2 city-3-loc-2 city-3-loc-1)
   deleted: (at truck-2 city-3-loc-2)
   added: (at truck-2 city-3-loc-1)
   goals met: 3 of 7
17. (pick-up truck-2 city-3-loc-1 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-3-loc-1) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 3 of 7
18. (pick-up truck-2 city-3-loc-1 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-3-loc-1) (capacity truck-2 capacity-1)
   added: (in package-5 truck-2) (capacity truck-2 capacity-0)
   goals met: 3 of 7
19. (drive truck-2 city-3-loc-1 city-2-loc-1)
   deleted: (at truck-2 city-3-loc-1)
   added: (at truck-2 city-2-loc-1)
   goals met: 3 of 7
20. (drop truck-2 city-2-loc-1 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-0)
   added: (at package-2 city-2-loc-1) (capacity truck-2 capacity-1)
   goals met: 4 of 7
21. (pick-up truck-2 city-2-loc-1 package-6 capacity-0 capacity-1)
   deleted: (at package-6 city-2-loc-1) (capacity truck-2 capacity-1)
   added: (in package-6 truck-2) (capacity truck-2 capacity-0)
   goals met: 4 of 7
22. (drive truck-2 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-2 city-2-loc-1)
   added: (at truck-2 city-2-loc-2)
   goals met: 4 of 7
23. (drop truck-2 city-2-loc-2 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-0)
   added: (at package-3 city-2-loc-2) (capacity truck-2 capacity-1)
   goals met: 5 of 7
24. (drop truck-2 city-2-loc-2 package-5 capacity-1 capacity-2)
   deleted: (in package-5 truck-2) (capacity truck-2 capacity-1)
   added: (at package-5 city-2-loc-2) (capacity truck-2 capacity-2)
   goals met: 6 of 7
25. (drive truck-2 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-3)
   goals met: 6 of 7
26. (drop truck-2 city-2-loc-3 package-6 capacity-2 capacity-3)
   deleted: (in package-6 truck-2) (capacity truck-2 capacity-2)
   added: (at package-6 city-2-loc-3) (capacity truck-2 capacity-3)
   goals met: 7 of 7
